programming/detour-hooking.org
#+TITLE: Detour hooking
#+AUTHOR: 8dcc
#+OPTIONS: toc:nil
#+STARTUP: nofold
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css">

[[file:../index.org][Index]] | [[file:index.org][Up]]

-----

#+TOC: headlines 2

* What does hooking mean?
:PROPERTIES:
:CUSTOM_ID: what-does-hooking-mean
:END:

Hooking consists in intercepting and altering function calls or event passed
between software components. In this case, we will be focusing on *function
hooking* for the =x86= and =x86_64= architectures.

Imagine the following =foo= function, called from =main=:

#+begin_src C
#include <stdio.h>

double foo(double a, double b) {
    printf("foo: %.1f + %.1f = %.1f\n", a, b, a + b);
    return a + b;
}

int main(void) {
    foo(5.0, 2.0);
    return 0;
}
#+end_src

Imagine this was a very important function that we wanted to intercept of
modify. The idea is that when =main= calls =foo=, we somehow intercept the call and
the control is passed to our =hook= function. From there, we could call the
original function, change the behavior, spoof the returned value, etc.

