programming/detour-hooking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Detour hooking</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Detour hooking</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#what-does-hooking-mean">1. What does hooking mean?</a></li>
<li><a href="#detour-hooking">2. Detour hooking</a></li>
<li><a href="#hooking-from-c">3. Hooking from C</a></li>
<li><a href="#detour-hooking-library">4. Detour hooking library</a></li>
</ul>
</div>
</div>

<div id="outline-container-what-does-hooking-mean" class="outline-2">
<h2 id="what-does-hooking-mean"><span class="section-number-2">1.</span> What does hooking mean?</h2>
<div class="outline-text-2" id="text-what-does-hooking-mean">
<p>
Hooking consists in intercepting and altering function calls or event passed
between software components. In this case, we will be focusing on <b>function
hooking</b> for the <code>x86</code> and <code>x86_64</code> architectures.
</p>

<p>
Imagine the following <code>foo</code> function, called from <code>main</code>:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdio.h&gt;</span>

<span style="color: #79a8ff;">double</span> <span style="color: #4ae2ff;">foo</span>(<span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">a</span>, <span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">b</span>) {
    printf(<span style="color: #00d3d0;">"foo: %.1f + %.1f = %.1f\n"</span>, a, b, a + b);
    <span style="color: #ff6f9f;">return</span> a + b;
}

<span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">main</span>(<span style="color: #79a8ff;">void</span>) {
    foo(<span style="color: #88ca9f;">5.0</span>, <span style="color: #88ca9f;">2.0</span>);
    <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
}
</pre>
</div>

<p>
Imagine this was a very important function that we wanted to intercept of
modify. The idea is that when <code>main</code> calls <code>foo</code>, we somehow intercept the call and
the control is passed to our <code>hook</code> function. From there, we could call the
original function, change the behavior, spoof the returned value, etc.
</p>
</div>
</div>
