programming/detour-hooking.html

<div id="outline-container-detour-hooking" class="outline-2">
<h2 id="detour-hooking"><span class="section-number-2">2.</span> Detour hooking</h2>
<div class="outline-text-2" id="text-detour-hooking">
<p>
Detour hooking is a hooking technique where we overwrite the first bytes of the
target function (<code>foo</code>) to introduce a jump to our <code>hook</code> function.
</p>

<p>
First, let's have a look at the disassembly of this <code>foo</code> function using <a href="https://rizin.re/">rizin</a>.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #989898;">; </span><span style="color: #989898;">CALL XREF from main @ 0x11b5</span>
fcn.00001139 <span style="color: #989898;">; </span><span style="color: #989898;">fcn.00001139(int64_t arg7, int64_t arg8);</span>
fcn.00001139 <span style="color: #989898;">;  </span><span style="color: #989898;">arg int64_t arg7 @ xmm0</span>
fcn.00001139 <span style="color: #989898;">;  </span><span style="color: #989898;">arg int64_t arg8 @ xmm1</span>
fcn.00001139 <span style="color: #989898;">;  </span><span style="color: #989898;">var int64_t var_18h @ stack - 0x18</span>
fcn.00001139 <span style="color: #989898;">;  </span><span style="color: #989898;">var int64_t var_10h @ stack - 0x10</span>
fcn.00001139         <span style="color: #88ca9f;">55</span>                      <span style="color: #feacd0;">push</span>    <span style="color: #6ae4b9;">rbp</span>
fcn.00001139+0x1     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> e5                <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">rbp</span>, <span style="color: #6ae4b9;">rsp</span>
fcn.00001139+0x4     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">83</span> ec <span style="color: #88ca9f;">10</span>             <span style="color: #feacd0;">sub</span>     <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">0x10</span>
fcn.00001139+0x8     f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">11</span> <span style="color: #88ca9f;">45</span> f8          <span style="color: #feacd0;">movsd</span>   <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">8</span>], <span style="color: #6ae4b9;">xmm0</span> <span style="color: #989898;">; </span><span style="color: #989898;">arg7</span>
fcn.00001139+0xd     f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">11</span> <span style="color: #88ca9f;">4d</span> f0          <span style="color: #feacd0;">movsd</span>   <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #6ae4b9;">xmm1</span> <span style="color: #989898;">; </span><span style="color: #989898;">arg8</span>
fcn.00001139+0x12    f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">10</span> <span style="color: #88ca9f;">45</span> f8          <span style="color: #feacd0;">movsd</span>   <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">8</span>]
fcn.00001139+0x17    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">28</span> c8             <span style="color: #feacd0;">movapd</span>  <span style="color: #6ae4b9;">xmm1</span>, <span style="color: #6ae4b9;">xmm0</span>
fcn.00001139+0x1b    f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">58</span> <span style="color: #88ca9f;">4d</span> f0          <span style="color: #feacd0;">addsd</span>   <span style="color: #6ae4b9;">xmm1</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
fcn.00001139+0x20    f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">10</span> <span style="color: #88ca9f;">45</span> f0          <span style="color: #feacd0;">movsd</span>   <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
fcn.00001139+0x25    <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> f8             <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">8</span>]
fcn.00001139+0x29    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">28</span> d1             <span style="color: #feacd0;">movapd</span>  <span style="color: #6ae4b9;">xmm2</span>, <span style="color: #6ae4b9;">xmm1</span>
fcn.00001139+0x2d    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">28</span> c8             <span style="color: #feacd0;">movapd</span>  <span style="color: #6ae4b9;">xmm1</span>, <span style="color: #6ae4b9;">xmm0</span>
fcn.00001139+0x31    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">6e</span> c0          <span style="color: #feacd0;">movq</span>    <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #6ae4b9;">rax</span>
fcn.00001139+0x36    <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">92</span> <span style="color: #88ca9f;">0e</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>    <span style="color: #feacd0;">lea</span>     <span style="color: #6ae4b9;">rax</span>, [rip + str.foo]
fcn.00001139+0x3d    <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>          <span style="color: #989898;">; </span><span style="color: #989898;">const char *format</span>
fcn.00001139+0x40    b8 <span style="color: #88ca9f;">03</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>          <span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">3</span>
fcn.00001139+0x45    e8 ad fe ff ff          <span style="color: #feacd0;">call</span>    sym.imp.printf    <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.printf ; int printf(const char *format)</span>
fcn.00001139+0x4a    f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">10</span> <span style="color: #88ca9f;">45</span> f8          <span style="color: #feacd0;">movsd</span>   <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">8</span>]
fcn.00001139+0x4f    f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">58</span> <span style="color: #88ca9f;">45</span> f0          <span style="color: #feacd0;">addsd</span>   <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
fcn.00001139+0x54    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">7e</span> c0          <span style="color: #feacd0;">movq</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">xmm0</span>
fcn.00001139+0x59    <span style="color: #88ca9f;">66</span> <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">6e</span> c0          <span style="color: #feacd0;">movq</span>    <span style="color: #6ae4b9;">xmm0</span>, <span style="color: #6ae4b9;">rax</span>
fcn.00001139+0x5e    c9                      <span style="color: #feacd0;">leave</span>
fcn.00001139+0x5f    c3                      <span style="color: #feacd0;">ret</span>
</pre>
</div>

<p>
At the right of the instructions, you can see their corresponding bytes. The
idea is to overwrite the first N bytes of the function in memory, so instead of
those <code>push</code> and <code>mov</code> instructions, we jump to our function.
</p>

<p>
Let's see how we can do that from assembly. Note that the byte order of the
addresses is "reversed" because of <a href="https://en.wikipedia.org/wiki/Endianness">endianness</a>.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #989898;">; </span><span style="color: #989898;">x86</span>
<span style="color: #feacd0;">mov</span>     <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">0x11223344</span>          <span style="color: #989898;">; </span><span style="color: #989898;">b8 44 33 22 11</span>
<span style="color: #feacd0;">jmp</span>     <span style="color: #6ae4b9;">eax</span>                      <span style="color: #989898;">; </span><span style="color: #989898;">ff e0</span>

<span style="color: #989898;">; </span><span style="color: #989898;">x86_64</span>
movabs  <span style="color: #6ae4b9;">rax</span>, <span style="color: #88ca9f;">0x1122334455667788</span>  <span style="color: #989898;">; </span><span style="color: #989898;">48 b8 88 77 66 55 44 33 22 11</span>
<span style="color: #feacd0;">jmp</span>     <span style="color: #6ae4b9;">rax</span>                      <span style="color: #989898;">; </span><span style="color: #989898;">ff e0</span>
</pre>
</div>

<p>
Now we know that we need to overwrite 7 bytes for 32-bit programs and 12 bytes
for 64-bit programs.
</p>

<p>
After overwriting, assuming our <code>hook</code> function is at <code>0xDEADBEEF</code> our function
would be:
</p>

<div class="org-src-container">
<pre class="src src-nasm">fcn.00001139         <span style="color: #88ca9f;">48</span> b8 ef be ad de <span style="color: #88ca9f;">00</span>    movabs  <span style="color: #6ae4b9;">rax</span>, <span style="color: #88ca9f;">0xDEADBEEF</span>
fcn.00001139         <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>
fcn.00001139+0x1     ff e0                   <span style="color: #feacd0;">jmp</span>     <span style="color: #6ae4b9;">rax</span>
fcn.00001139+0x4     f8                      <span style="color: #feacd0;">clc</span>
fcn.00001139+0x8     f2 <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">11</span> <span style="color: #88ca9f;">4d</span> f0          <span style="color: #feacd0;">movsd</span>   <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #6ae4b9;">xmm1</span> <span style="color: #989898;">; </span><span style="color: #989898;">arg8</span>
<span style="color: #989898;">; </span><span style="color: #989898;">...</span>
</pre>
</div>
</div>
</div>
