programming/detour-hooking.org
* Hooking from C
:PROPERTIES:
:CUSTOM_ID: hooking-from-c
:END:

The basic process from C would be:

1. Get the address of the =foo= and =hook= functions.
2. Store the first N bytes of =foo=, so we can restore them when necessary.
3. Create the final /jump/ bytes by placing the address of our =hook= function.
4. Change the permissions of the =foo= function to make sure we can write to them.
5. Overwrite the first N bytes of =foo= with our /jump/ bytes.
6. Restore the old permissions for =foo=.

First, we need to declare the placeholder for the /jump/ bytes. We will change the
declaration depending on the architecture with =#ifdef=.

#+begin_src C
#include <stdint.h>

#ifdef __i386__
static uint8_t jmp_bytes[] = { 0xB8, 0x00, 0x00, 0x00, 0x00, 0xFF, 0xE0 };
#define JMP_BYTES_OFF 1 /* Offset inside the array where the ptr should go */
#else
static uint8_t jmp_bytes[] = { 0x48, 0xB8, 0x00, 0x00, 0x00, 0x00,
                               0x00, 0x00, 0x00, 0x00, 0xFF, 0xE0 };
#define JMP_BYTES_OFF 2 /* Offset inside the array where the ptr should go */
#endif
#+end_src

We will use =JMP_BYTES_OFF= to specify the position inside the =jmp_bytes= array
where the =hook= address will be.

We will also declare a =protect_addr= function for changing the permission of the
memory page where the =ptr= is. Since I am on linux, I will use =mprotect=, but if
you are on windows you should use something like =VirtualProtect= ([[https://github.com/8dcc/libdetour/blob/a0f774be08b8f548913a07d48db2633c1a52494c/src/libdetour.c#L60-L66][Link]]).

#+begin_src C
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>   /* getpagesize */
#include <sys/mman.h> /* mprotect */

static bool protect_addr(void* ptr, int new_flags) {
    long page_size      = sysconf(_SC_PAGESIZE);
    long page_mask      = ~(page_size - 1);
    uintptr_t next_page = ((uintptr_t)ptr + page_size - 1) & page_mask;
    uintptr_t prev_page = next_page - page_size;
    void* page          = (void*)prev_page;

    if (mprotect(page, page_size, new_flags) == -1)
        return false;

    return true;
}
#+end_src

First, we get the next page by masking the address plus the page size minus one
with =~(page_size - 1)=. We need to add the page size minus one to make sure we
don't align an already aligned address. Then we subtract the page size to get
the address of the previous page. For more information see [[https://stackoverflow.com/a/22971450/11715554][this StackOverflow
answer]].

#+begin_example
Ptr:                 0x12345    0b10010001101000101
Page size:           0x01000    0b00001000000000000
Page size - 1:       0x00FFF    0b00000111111111111
After NOT (Mask):    0xFF000    0b11111000000000000
After adding to ptr: 0x13344    0b10011001101000100
Ptr & Mask:          0x13000    0b10011000000000000
Minus page size:     0x12000    0b10010000000000000
#+end_example

Let's declare our sample hook.

#+begin_src C
double hook(double a, double b) {
    printf("hook: intercepted %.1f and %.1f\n", a, b);
    printf("hook: overwriting return value...\n");
    return 420;
}
#+end_src

Now, we need to get the function pointers and store the first N bytes of
=foo=. This is important since these bytes will be used for unhooking and for
calling the original function from our hook.

#+begin_src C
#include <string.h>

void* orig_ptr = &foo;  /* foo(...) */
void* hook_ptr = &hook; /* hook(...) */

/* Store first N bytes of `foo' into `saved_bytes' */
#define N sizeof(jmp_bytes)
static uint8_t saved_bytes[N];
memcpy(saved_bytes, orig_ptr, N);
#+end_src

Then, we *place the pointer* of our =hook= into the =jmp_bytes= array. Note that we
pass =&hook_ptr= instead of =hook_ptr= directly because we want to copy the function
address, not the first 8 bytes of our hook function.

#+begin_src C
memcpy(&jmp_bytes[JMP_BYTES_OFF], &hook_ptr, sizeof(void*));
#+end_src

Now that we are set up, we can actually *hook* our function.

#+begin_src C
/* Try to add WRITE permissions to `orig_ptr' */
if (!protect_addr(orig_ptr, PROT_READ | PROT_WRITE | PROT_EXEC))
    return;

/* Overwrite the first N bytes of `foo' with our jmp instruction */
memcpy(orig_ptr, jmp_bytes, sizeof(jmp_bytes));

/* Restore old protection, assuming it was r-x */
if (!protect_addr(orig_ptr, PROT_READ | PROT_EXEC))
    return;
#+end_src

And with that, our function is hooked. Every time =foo= gets called, our =hook=
function will get called instead.

*Unhooking* the function is easy, we just need to restore =saved_bytes=.

#+begin_src C
if (!protect_addr(orig_ptr, PROT_READ | PROT_WRITE | PROT_EXEC))
    return;

/* Restore the first N bytes of `foo' */
memcpy(orig_ptr, saved_bytes, sizeof(saved_bytes));

if (!protect_addr(orig_ptr, PROT_READ | PROT_EXEC))
    return;
#+end_src

*Calling the original* function from our hook is as simple as unhooking, calling
with the intercepted parameters and hooking again.

#+begin_src C
typedef double (*orig_t)(double, double);

double result;

unhook(orig_ptr, saved_bytes);
result = (orig_t)orig_ptr(a, b);
hook(orig_ptr, jmp_bytes);
#+end_src

