programming/detour-hooking.html

<div id="outline-container-hooking-from-c" class="outline-2">
<h2 id="hooking-from-c"><span class="section-number-2">3.</span> Hooking from C</h2>
<div class="outline-text-2" id="text-hooking-from-c">
<p>
The basic process from C would be:
</p>

<ol class="org-ol">
<li>Get the address of the <code>foo</code> and <code>hook</code> functions.</li>
<li>Store the first N bytes of <code>foo</code>, so we can restore them when necessary.</li>
<li>Create the final <i>jump</i> bytes by placing the address of our <code>hook</code> function.</li>
<li>Change the permissions of the <code>foo</code> function to make sure we can write to them.</li>
<li>Overwrite the first N bytes of <code>foo</code> with our <i>jump</i> bytes.</li>
<li>Restore the old permissions for <code>foo</code>.</li>
</ol>

<p>
First, we need to declare the placeholder for the <i>jump</i> bytes. We will change the
declaration depending on the architecture with <code>#ifdef</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdint.h&gt;</span>

<span style="color: #ff6740;">#ifdef</span> __i386__
<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">jmp_bytes</span>[] = { <span style="color: #88ca9f;">0xB8</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0xFF</span>, <span style="color: #88ca9f;">0xE0</span> };
<span style="color: #ff6740;">#define</span> <span style="color: #6ae4b9;">JMP_BYTES_OFF</span> <span style="color: #88ca9f;">1</span> <span style="color: #989898;">/* </span><span style="color: #989898;">Offset inside the array where the ptr should go</span><span style="color: #989898;"> */</span>
<span style="color: #ff6740;">#else</span>
<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">jmp_bytes</span>[] = { <span style="color: #88ca9f;">0x48</span>, <span style="color: #88ca9f;">0xB8</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>,
                               <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0x00</span>, <span style="color: #88ca9f;">0xFF</span>, <span style="color: #88ca9f;">0xE0</span> };
<span style="color: #ff6740;">#define</span> <span style="color: #6ae4b9;">JMP_BYTES_OFF</span> <span style="color: #88ca9f;">2</span> <span style="color: #989898;">/* </span><span style="color: #989898;">Offset inside the array where the ptr should go</span><span style="color: #989898;"> */</span>
<span style="color: #ff6740;">#endif</span>
</pre>
</div>

<p>
We will use <code>JMP_BYTES_OFF</code> to specify the position inside the <code>jmp_bytes</code> array
where the <code>hook</code> address will be.
</p>

<p>
We will also declare a <code>protect_addr</code> function for changing the permission of the
memory page where the <code>ptr</code> is. Since I am on linux, I will use <code>mprotect</code>, but if
you are on windows you should use something like <code>VirtualProtect</code> (<a href="https://github.com/8dcc/libdetour/blob/a0f774be08b8f548913a07d48db2633c1a52494c/src/libdetour.c#L60-L66">Link</a>).
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdint.h&gt;</span>
<span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdbool.h&gt;</span>
<span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;unistd.h&gt;</span>   <span style="color: #989898;">/* </span><span style="color: #989898;">getpagesize</span><span style="color: #989898;"> */</span>
<span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;sys/mman.h&gt;</span> <span style="color: #989898;">/* </span><span style="color: #989898;">mprotect</span><span style="color: #989898;"> */</span>

<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">bool</span> <span style="color: #4ae2ff;">protect_addr</span>(<span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">ptr</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">new_flags</span>) {
    <span style="color: #79a8ff;">long</span> <span style="color: #6ae4b9;">page_size</span>      = sysconf(_SC_PAGESIZE);
    <span style="color: #79a8ff;">long</span> <span style="color: #6ae4b9;">page_mask</span>      = ~(page_size - <span style="color: #88ca9f;">1</span>);
    <span style="color: #79a8ff;">uintptr_t</span> <span style="color: #6ae4b9;">next_page</span> = ((<span style="color: #79a8ff;">uintptr_t</span>)ptr + page_size - <span style="color: #88ca9f;">1</span>) &amp; page_mask;
    <span style="color: #79a8ff;">uintptr_t</span> <span style="color: #6ae4b9;">prev_page</span> = next_page - page_size;
    <span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">page</span>          = (<span style="color: #79a8ff;">void</span>*)prev_page;

    <span style="color: #ff6f9f;">if</span> (mprotect(page, page_size, new_flags) == -<span style="color: #88ca9f;">1</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">false</span>;

    <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">true</span>;
}
</pre>
</div>

<p>
First, we get the next page by masking the address plus the page size minus one
with <code>~(page_size - 1)</code>. We need to add the page size minus one to make sure we
don't align an already aligned address. Then we subtract the page size to get
the address of the previous page. For more information see <a href="https://stackoverflow.com/a/22971450/11715554">this StackOverflow
answer</a>.
</p>

<pre class="example" id="orgcb6af85">
Ptr:                 0x12345    0b10010001101000101
Page size:           0x01000    0b00001000000000000
Page size - 1:       0x00FFF    0b00000111111111111
After NOT (Mask):    0xFF000    0b11111000000000000
After adding to ptr: 0x13344    0b10011001101000100
Ptr &amp; Mask:          0x13000    0b10011000000000000
Minus page size:     0x12000    0b10010000000000000
</pre>

<p>
Let's declare our sample hook.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">double</span> <span style="color: #4ae2ff;">hook</span>(<span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">a</span>, <span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">b</span>) {
    printf(<span style="color: #00d3d0;">"hook: intercepted %.1f and %.1f\n"</span>, a, b);
    printf(<span style="color: #00d3d0;">"hook: overwriting return value...\n"</span>);
    <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">420</span>;
}
</pre>
</div>

<p>
Now, we need to get the function pointers and store the first N bytes of
<code>foo</code>. This is important since these bytes will be used for unhooking and for
calling the original function from our hook.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;string.h&gt;</span>

<span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">orig_ptr</span> = &amp;foo;  <span style="color: #989898;">/* </span><span style="color: #989898;">foo(...)</span><span style="color: #989898;"> */</span>
<span style="color: #79a8ff;">void</span>* <span style="color: #6ae4b9;">hook_ptr</span> = &amp;hook; <span style="color: #989898;">/* </span><span style="color: #989898;">hook(...)</span><span style="color: #989898;"> */</span>

<span style="color: #989898;">/* </span><span style="color: #989898;">Store first N bytes of `foo' into `saved_bytes'</span><span style="color: #989898;"> */</span>
<span style="color: #ff6740;">#define</span> <span style="color: #6ae4b9;">N</span> <span style="color: #ff6f9f;">sizeof</span>(jmp_bytes)
<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">saved_bytes</span>[N];
<span style="color: #4ae2ff;">memcpy</span>(saved_bytes, orig_ptr, N);
</pre>
</div>

<p>
Then, we <b>place the pointer</b> of our <code>hook</code> into the <code>jmp_bytes</code> array. Note that we
pass <code>&amp;hook_ptr</code> instead of <code>hook_ptr</code> directly because we want to copy the function
address, not the first 8 bytes of our hook function.
</p>

<div class="org-src-container">
<pre class="src src-C">memcpy(&amp;jmp_bytes[JMP_BYTES_OFF], &amp;hook_ptr, <span style="color: #ff6f9f;">sizeof</span>(<span style="color: #79a8ff;">void</span>*));
</pre>
</div>

<p>
Now that we are set up, we can actually <b>hook</b> our function.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #989898;">/* </span><span style="color: #989898;">Try to add WRITE permissions to `orig_ptr'</span><span style="color: #989898;"> */</span>
<span style="color: #ff6f9f;">if</span> (<span style="color: #ff6740; font-weight: bold;">!</span>protect_addr(orig_ptr, PROT_READ | PROT_WRITE | PROT_EXEC))
    <span style="color: #ff6f9f;">return</span>;

<span style="color: #989898;">/* </span><span style="color: #989898;">Overwrite the first N bytes of `foo' with our jmp instruction</span><span style="color: #989898;"> */</span>
<span style="color: #4ae2ff;">memcpy</span>(orig_ptr, jmp_bytes, <span style="color: #ff6f9f;">sizeof</span>(jmp_bytes));

<span style="color: #989898;">/* </span><span style="color: #989898;">Restore old protection, assuming it was r-x</span><span style="color: #989898;"> */</span>
<span style="color: #ff6f9f;">if</span> (<span style="color: #ff6740; font-weight: bold;">!</span>protect_addr(orig_ptr, PROT_READ | PROT_EXEC))
    <span style="color: #ff6f9f;">return</span>;
</pre>
</div>

<p>
And with that, our function is hooked. Every time <code>foo</code> gets called, our <code>hook</code>
function will get called instead.
</p>

<p>
<b>Unhooking</b> the function is easy, we just need to restore <code>saved_bytes</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">if</span> (<span style="color: #ff6740; font-weight: bold;">!</span>protect_addr(orig_ptr, PROT_READ | PROT_WRITE | PROT_EXEC))
    <span style="color: #ff6f9f;">return</span>;

<span style="color: #989898;">/* </span><span style="color: #989898;">Restore the first N bytes of `foo'</span><span style="color: #989898;"> */</span>
<span style="color: #4ae2ff;">memcpy</span>(orig_ptr, saved_bytes, <span style="color: #ff6f9f;">sizeof</span>(saved_bytes));

<span style="color: #ff6f9f;">if</span> (<span style="color: #ff6740; font-weight: bold;">!</span>protect_addr(orig_ptr, PROT_READ | PROT_EXEC))
    <span style="color: #ff6f9f;">return</span>;
</pre>
</div>

<p>
<b>Calling the original</b> function from our hook is as simple as unhooking, calling
with the intercepted parameters and hooking again.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">typedef</span> <span style="color: #79a8ff;">double</span> (*<span style="color: #79a8ff;">orig_t</span>)(<span style="color: #79a8ff;">double</span>, <span style="color: #79a8ff;">double</span>);

<span style="color: #79a8ff;">double</span> <span style="color: #6ae4b9;">result</span>;

<span style="color: #4ae2ff;">unhook</span>(orig_ptr, saved_bytes);
result = (<span style="color: #79a8ff;">orig_t</span>)<span style="color: #4ae2ff;">orig_ptr</span>(a, b);
<span style="color: #4ae2ff;">hook</span>(orig_ptr, jmp_bytes);
</pre>
</div>
</div>
</div>
