programming/detour-hooking.html

<div id="outline-container-detour-hooking-library" class="outline-2">
<h2 id="detour-hooking-library"><span class="section-number-2">4.</span> Detour hooking library</h2>
<div class="outline-text-2" id="text-detour-hooking-library">
<p>
I made a simple detour hooking library in pure C for both GNU/Linux and
Windows. The platform-specific function is <code>protect_addr()</code>.
</p>

<p>
To use it, you just need to:
</p>

<ol class="org-ol">
<li>Use the <code>LIBDETOUR_DECL_TYPE</code> macro to specify the type of your original
function.</li>
<li>Declare a <i>Detour Context</i>, and initialize it by calling <code>libdetour_init</code> with
the original and hook function pointers.</li>
<li>To add the hook, call <code>libdetour_add</code> with the context you just declared.</li>
<li>To call the original function, use the <code>LIBDETOUR_ORIG_CALL</code> or
<code>LIBDETOUR_ORIG_GET</code> macros, depending on if you want to store the returned
value.</li>
<li>When you are done, remove the hook by passing the <i>Detour Context</i> to the
<code>libdetour_del</code> function.</li>
</ol>

<p>
You can find the code, full usage and an example in the <a href="https://github.com/8dcc/libdetour">GitHub repository</a>.
</p>
</div>
</div>
</div>
</body>
</html>
